//Задача 3: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.

Console.WriteLine("Задача 3: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.");
